---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.OffsetFromReferenceBase
source: html/7c4c8493-e001-4ee3-a649-d783f6ca15c0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.OffsetFromReferenceBase Property

"Offset from Reference Base"

## Syntax (C#)
```csharp
public static ForgeTypeId OffsetFromReferenceBase { get; }
```